In [1]:
#Importing Pandas Library
import pandas as pd

In [6]:
#creating dictionary
Data_analytics_student = {
    'Name':['Favour', 'Praise','Peculiar','Janet','Gift','Princess'],
    'Age':[12,10,13,17,20,11],
    'Location':['Karu','Gwagalada','Lugbe','Maitama','Kubwa','Gwarimpa'],
    'Hobby':['singing','drawing','acting','reading','dancing','cooking']
}

In [11]:
#converting to dataframe
df = pd.DataFrame(Data_analytics_student)
df

       Name  Age   Location    Hobby
0    Favour   12       Karu  singing
1    Praise   10  Gwagalada  drawing
2  Peculiar   13      Lugbe   acting
3     Janet   17    Maitama  reading
4      Gift   20      Kubwa  dancing
5  Princess   11   Gwarimpa  cooking

In [15]:
df['Age']

0    12
1    10
2    13
3    17
4    20
5    11
Name: Age, dtype: int64

In [19]:
#selecting row index 2
df['Name']
df['Location']
df['Age']
df.iloc [2]
df.iloc[2:4]

       Name  Age Location    Hobby
2  Peculiar   13    Lugbe   acting
3     Janet   17  Maitama  reading

In [20]:
#create a dictionary that has 3 keys and contains 5 values in each keys
#convert to dataframe
#select the second column
#select the item in row index number 2 above

In [21]:
Manufacturers ={
    'Automobiles':['Toyota', 'Volkswagen','Ford','Hyundia','Kia'],
    'Beverages':['Cadbury','Bournvita','Nestle','Peak','Unilever'],
    'Fruits':['Plum','Banana','Apple','Pear','Orange'],
}

In [24]:
df = pd.DataFrame(Manufacturers)
df

  Automobiles  Beverages  Fruits
0      Toyota    Cadbury    Plum
1  Volkswagen  Bournvita  Banana
2        Ford     Nestle   Apple
3     Hyundia       Peak    Pear
4         Kia   Unilever  Orange

In [28]:
df['Beverages']

0      Cadbury
1    Bournvita
2       Nestle
3         Peak
4     Unilever
Name: Beverages, dtype: object

In [26]:
df.iloc[2:5]

  Automobiles Beverages  Fruits
2        Ford    Nestle   Apple
3     Hyundia      Peak    Pear
4         Kia  Unilever  Orange

Loading Data